RoutesAndControls/Projects/ArtShare/app/controllers/artworkshares_controller.rb

    def create
        share = ArtworkShare.new(share_params)
        if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 1], ["created_at", "2020-07-23 06:07:11.965627"], ["updated_at", "2020-07-23 06:07:11.965627"]]

    def destroy

        share = ArtworkShare.find(params[:id])
        ArtworkShare.destroy(params[:id])
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 2]]