RoutesAndControls/Projects/ArtShare/app/controllers/artworks_controller.rb

    def index
        # user = User.find(params[:id])

        user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update

        artwork = Artwork.update(params[:id], artwork_params)
---
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Cool pic with a wedding ring and a hole"], ["updated_at", "2020-07-21 18:19:58.187709"], ["id", 2]]

    def destroy

        artwork = Artwork.find(params[:id])
        Artwork.destroy(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 2]]