RoutesAndControls/Projects/ArtShare/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
---
    def index
        if comment_params.has_key?(:user_id)
            comments = Comment.where(user_id: comment_params[:user_id])
        elsif comment_params.has_key?(:artwork_id)
            comments = Comment.where(artwork_id: comment_params[:artwork_id])