RoutesAndControls/Projects/ArtShare/app/controllers/users_controller.rb

    def index
        if user_params.has_key?(:username)
            user = User.where("username LIKE ?", user_params[:username])
            if user.empty?
                render json: {status: :bad_request}
            else
                render json: user
            end
        else
            render json: User.all
---
SELECT "users".* FROM "users" WHERE (username LIKE 'Originator')
SELECT "users".* FROM "users"
SELECT  1 AS one FROM "users" WHERE (username LIKE 'anus') LIMIT $1  [["LIMIT", 1]]

    def update

        user = User.update(params[:id], user_params)
---
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "NewOrig"], ["updated_at", "2020-07-21 17:37:49.505209"], ["id", 2]]

    def destroy
        user = User.find(params[:id])
        User.destroy(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]