Views/Projects/Cats/app/controllers/cat_rental_requests_controller.rb

    def new
        @rental = CatRentalRequest.new
        @cats = Cat.all
---
SELECT "cats".* FROM "cats"

    def create
        @rental = CatRentalRequest.new(rent_params)
        @cats = Cat.all
        if @rental.save
---
SELECT "cats".* FROM "cats"
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["start_date", "2020-08-10"], ["end_date", "2020-08-11"], ["created_at", "2020-08-10 18:53:39.523587"], ["updated_at", "2020-08-10 18:53:39.523587"]]

    def approve

        @rental = CatRentalRequest.find_by(id: params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def deny
        @rental = CatRentalRequest.find_by(id: params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]