Views/Projects/Cats/app/controllers/cat_rental_requests_controller.rb

    def index
        @rentals = Cat.all
---
SELECT "cats".* FROM "cats"