Views/Projects/Cats/app/controllers/cats_controller.rb

    def show
        @rentals = CatRentalRequest.where("cat_id = ?", params[:id]).order(start_date: :asc)
        @cat = Cat.find_by(id: params[:id])
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE (cat_id = '1') ORDER BY "cat_rental_requests"."start_date" DESC
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "sex" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "Red"], ["sex", "A"], ["updated_at", "2020-08-05 17:40:00.887871"], ["id", 1]]