Auth2/Projects/Music/app/controllers/albums_controller.rb

    def edit
        @album = Album.find(params[:id])
        @bands = Band.all
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"

    def new
        @album = Album.new
        @bands = Band.all
        @band = Band.find(params[:band_id])
---
SELECT "bands".* FROM "bands"
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @album = Album.find(params[:id])

        if @album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "studio" = $2, "band_id" = $3, "updated_at" = $4 WHERE "albums"."id" = $5  [["title", "We are the CoolerGuys Best Hits"], ["studio", true], ["band_id", 2], ["updated_at", "2020-09-04 21:01:37.863308"], ["id", 1]]

    def create
        @album = Album.new(album_params)

        if @album.save!
---
INSERT INTO "albums" ("title", "year", "band_id", "studio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "OK"], ["year", 420], ["band_id", 1], ["studio", false], ["created_at", "2020-09-08 20:54:18.645137"], ["updated_at", "2020-09-08 20:54:18.645137"]]