Auth2/Projects/Music/app/controllers/notes_controller.rb

INSERT INTO "notes" ("body", "created_at", "updated_at", "track_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "HUH"], ["created_at", "2020-09-08 18:09:26.037643"], ["updated_at", "2020-09-08 18:09:26.037643"], ["track_id", 1], ["user_id", 3]]
---
    def create
        @note = Note.new(note_params)
        @note.user_id = current_user.id
        @note.save!