Auth2/Projects/Music/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        @user.password = user_params[:password]

        if @user.save!