Testing/Homework/Music/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "8ofAR8SGDjvPW3mIQyq5TA"], ["LIMIT", 1]]
---
    def current_user
        return nil if session[:session_token].nil?
        @current_user ||= User.find_by(session_token: self.session[:session_token])