Testing/Homework/Music/app/controllers/bands_controller.rb

    def create
        @band = Band.new(band_params)
        @band.save!
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "AAA"], ["created_at", "2020-09-08 19:58:37.684105"], ["updated_at", "2020-09-08 19:58:37.684105"]]