Testing/Homework/Music/app/controllers/notes_controller.rb

INSERT INTO "notes" ("body", "created_at", "updated_at", "track_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "HUH"], ["created_at", "2020-09-08 18:09:26.037643"], ["updated_at", "2020-09-08 18:09:26.037643"], ["track_id", 1], ["user_id", 3]]
---
    def create
        @note = Note.new(note_params)
        @note.user_id = current_user.id
        @note.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 4]]
---
    def destroy

        if @note.user_id != current_user.id
            render text: "FORBIDDEN EXODIA"
        end

        @note = Note.find(params[:id])
        @note.destroy