Testing/Homework/Music/app/controllers/tracks_controller.rb

    def new
        @track = Track.new
        @albums = Album.all
        @album = Album.find(params[:album_id])
---
SELECT "albums".* FROM "albums"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @track = Track.new(track_params)
        if @track.save!
---
INSERT INTO "tracks" ("created_at", "updated_at", "title", "ord", "lyrics", "bonus", "album_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2020-09-04 20:41:39.713621"], ["updated_at", "2020-09-04 20:41:39.713621"], ["title", "Track 4"], ["ord", 4], ["lyrics", "Oh my god"], ["bonus", true], ["album_id", 1]]

    def update
        @track = Track.find(params[:id])
        if @track.update_attributes(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "title" = $1, "lyrics" = $2, "updated_at" = $3 WHERE "tracks"."id" = $4

    def edit
        @track = Track.find(params[:id])
        @albums = Album.all
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "albums".* FROM "albums"