Testing/Projects/MyGoals/app/views/goals/show.html.erb

SELECT "goal_comments".* FROM "goal_comments" WHERE "goal_comments"."goal_id" = $1  [["goal_id", 1]]
---

<% @goal.goal_comments.each do |comm| %>