Testing/Projects/MyGoals/app/views/users/show.html.erb


<% @user.user_comments.each do |comm| %>
---
SELECT "user_comments".* FROM "user_comments" WHERE "user_comments"."user_id" = $1  [["user_id", 1]]