Views/Projects/Cats/app/models/cat_rental_request.rb

    def overlapping_approved_requests
        s = ["APPROVED", "PENDING", "DENIED"]
        overlapping_requests.where("status = ?", s[0])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE (start_date BETWEEN '2020-10-21' AND '2020-11-13' OR end_date BETWEEN '2020-10-21' AND '2020-11-13') AND (cat_id = NULL) AND "cat_rental_requests"."status" = $1 LIMIT $2  [["status", "APPROVED"], ["LIMIT", 1]]