Views/Projects/Cats/app/models/cat_rental_request.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE (start_date BETWEEN '2020-01-02' AND '2020-01-03' OR end_date BETWEEN '2020-01-02' AND '2020-01-03') AND (cat_id = 1) AND (status = 'PENDING') AND NOT (id = 1) ORDER BY "cat_rental_requests"."created_at" DESC
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2020-08-10 20:39:28.222029"], ["id", 1]]
---
    def approve!
        self.transaction do
            overlapping_pending_requests.each do |req|
                req.update(status: "DENIED")
            end

            self.update(status: "APPROVED")

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-08-10 21:02:15.164244"], ["id", 11]]
---
    def deny!
        self.update(status: "DENIED")

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def overlapping_requests
        start = self.start_date
        ed = self.end_date
        req = CatRentalRequest
        .where("start_date BETWEEN ? AND ? OR end_date BETWEEN ? AND ?", start, ed, start, ed)
        .where("cat_id = ?", self.cat_id)

SELECT  1 AS one FROM "cat_rental_requests" WHERE (start_date BETWEEN '2020-01-02' AND '2020-01-03' OR end_date BETWEEN '2020-01-02' AND '2020-01-03') AND (cat_id = 1) AND (status = 'APPROVED') LIMIT $1  [["LIMIT", 1]]
---
    def no_overlaps
        unless overlapping_approved_requests.empty?