RoutesAndControls/Projects/Routes/app/controllers/users_controller.rb

    def show
        # user = User.new(params.require(:user).permit(:id))

        user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def update
        # User.update(params[:id], :name => params[:name], :email => params[:email])


        User.update(params[:id], params.require(:user).permit(:name, :email))

        render json: User.find(params[:id])
---
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "ColaDude"], ["email", "BiggButts@gmail.com"], ["updated_at", "2020-07-16 20:38:52.463410"], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy

        User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]