Testing/Projects/MyGoals/app/controllers/application_controller.rb

    def current_user
        return nil if session[:session_token].nil?
        @current_user ||= User.find_by(session_token: self.session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "BdGen6Y_HI293nQoPDb65A"], ["LIMIT", 1]]