Testing/Projects/MyGoals/app/controllers/comments_controller.rb

    def edit
        @comment = Comment.find_by(id: params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]

    def create
        @comment = Comment.new(comment_params)

        if @comment.save
---
INSERT INTO "comments" ("title", "body", "commentable_type", "commentable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "fdg"], ["body", "sdgfgdf"], ["commentable_type", "User"], ["commentable_id", 1], ["created_at", "2020-10-08 20:01:50.117490"], ["updated_at", "2020-10-08 20:01:50.117490"]]

    def update

        @comment = Comment.find_by(id: params[:id])

        if @comment.nil?
            flash.now[:errors] = "Cannot be updated."
            redirect_to users_url
        else
            if @comment.update_attributes(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "New goal!"], ["updated_at", "2020-10-08 19:41:05.145802"], ["id", 78]]

    def destroy
        @comment = Comment.find_by(id: params[:id])

        if @comment.nil?
            flash.now[:errors] = "Not a valid Comment to be deleted."
            redirect_to users_url
        else
            @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]