Testing/Projects/MyGoals/app/controllers/goal_comments_controller.rb

SELECT  "goal_comments".* FROM "goal_comments" WHERE "goal_comments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @goalcomment = GoalComment.find_by(id: params[:id])

INSERT INTO "goal_comments" ("body", "goal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Good goal!"], ["goal_id", 53], ["created_at", "2020-10-08 02:46:54.215904"], ["updated_at", "2020-10-08 02:46:54.215904"]]
---
    def create
        @goalcomment = GoalComment.new(goalcomment_params)

        if @goalcomment.save

SELECT  "goal_comments".* FROM "goal_comments" WHERE "goal_comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show

        @goalcomment = GoalComment.find_by(id: params[:id])

SELECT  "goal_comments".* FROM "goal_comments" WHERE "goal_comments"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "goal_comments" SET "body" = $1, "updated_at" = $2 WHERE "goal_comments"."id" = $3  [["body", "New goal!"], ["updated_at", "2020-10-08 02:34:16.034205"], ["id", 17]]
---
    def update

        @goalcomment = GoalComment.find_by(id: params[:id])

        if @goalcomment.nil?
            flash.now[:errors] = "Cannot be updated."
            redirect_to goal_comment_url(params[:id])
        else
            if @goalcomment.update_attributes(goalcomment_params)

SELECT  "goal_comments".* FROM "goal_comments" WHERE "goal_comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "goal_comments" WHERE "goal_comments"."id" = $1  [["id", 1]]
---
    def destroy
        @goalcomment = GoalComment.find_by(id: params[:id])

        if @goalcomment.nil?
            flash.now[:errors] = "Not a valid GoalComment to be deleted."
            redirect_to goals_url
        else
            @goalcomment.destroy