Testing/Projects/MyGoals/app/controllers/goals_controller.rb

    def create
        @goal = Goal.new(goal_params)

        if @goal.save
---
INSERT INTO "goals" ("body", "user_id", "created_at", "updated_at", "title", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "OK"], ["user_id", 1], ["created_at", "2020-10-01 01:14:51.520584"], ["updated_at", "2020-10-01 01:14:51.520584"], ["title", "OK"], ["status", "OPEN"]]

    def show
        @goal = Goal.find_by(id: params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @goal = Goal.find_by(id: params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
        @goal = Goal.find_by(id: params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", -1], ["LIMIT", 1]]