Testing/Projects/MyGoals/app/controllers/user_comments_controller.rb

SELECT  "user_comments".* FROM "user_comments" WHERE "user_comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @usercomment = UserComment.find_by(id: params[:id])

INSERT INTO "user_comments" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Round 1"], ["user_id", 1], ["created_at", "2020-10-05 16:15:24.653527"], ["updated_at", "2020-10-05 16:15:24.653527"]]
---
    def create
        @usercomment = UserComment.new(usercomment_params)

        if @usercomment.save

SELECT  "user_comments".* FROM "user_comments" WHERE "user_comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show

        @usercomment = UserComment.find_by(id: params[:id])

SELECT  "user_comments".* FROM "user_comments" WHERE "user_comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "user_comments" SET "body" = $1, "updated_at" = $2 WHERE "user_comments"."id" = $3  [["body", "ssad"], ["updated_at", "2020-10-05 16:05:07.579129"], ["id", 1]]
---
    def update

        @usercomment = UserComment.find_by(id: params[:id])

        if @usercomment.nil?
            flash.now[:errors] = "Cannot be updated."
            redirect_to user_comment_url(params[:id])
        else
            if @usercomment.update_attributes(usercomment_params)

SELECT  "user_comments".* FROM "user_comments" WHERE "user_comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "user_comments" WHERE "user_comments"."id" = $1  [["id", 2]]
---
    def destroy
        @usercomment = UserComment.find_by(id: params[:id])

        if @usercomment.nil?
            flash.now[:errors] = "Not a valid usercomment to be deleted."
            redirect_to users_url
        else
            @usercomment.destroy